<template>
    <div>
        <Modal v-model="isModalProtocol" class-name="vertical-center-modal" width="900">
            <div class="protocolText">
                <h3 slot="header">药金融信息服务平台服务协议</h3>
                <p>本协议是由 “北京融贯电子商务有限公司”（以下简称“本公司”）与本公司运营的“药金融信息服务平台”用户（以下简称“您”或“商家”）共同签署，就本公司依托“药金融信息服务平台”向您提供金融信息咨询服务所订立的契约。<span>您通过网络页面点击确认，即表示您同意接受本协议的全部约定内容以及与本协议有关的已经发布或将来可能发布的各项规则、页面展示、操作流程、公告或通知（以下统称“规则”）。在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以粗体标注的内容）。如果您不同意本协议的任意内容，或者无法准确理解该条款的含义，请不要进行任何操作。</span></p>
                <h4>一、定义</h4>
                <p>1、药金融信息服务平台：是指由本公司运营的药金融信息服务网站及移动客户。</p>
                <p>2、金融机构：是指从事金融服务业、具备融资服务经营资质的第三方金融中介机构，包括但不限于银行、小贷公司、保理公司等。</p>
                <p>3、授信额度：是指金融机构在约定期限内给予商家的最高融资额度。</p>
                <p>4、金融信息咨询服务：是指通过药金融信息服务平台，由本公司向商家提供的金融信息咨询服务。</p>
                <h4>二、服务内容</h4>
                <p>1、本公司依托药金融信息服务平台向商家提供金融信息咨询服务（以下简称“本服务”），服务内容包括：</p>
                <p>（1）一般性融资活动建议；</p>
                <p>（2）第三方金融产品推荐；</p>
                <p>（3）金融服务机构推荐；</p>
                <p>（4）融资资料协助整理转交。</p>
                <p><span>2、药金融信息服务平台的所有产品均由金融机构提供具体的融资服务，本公司仅为商家提供信息咨询服务。</span></p>
                <h4>三、资格要求</h4>
                <p>1、商家申请药金融信息服务平台具体服务的，须持续的同时满足以下条件：</p>
                <p>（1）商家已注册成为药金融信息服务平台用户；</p>
                <p>（2）商家已依照中华人民共和国法律法规注册并领取合法有效的营业执照及其他经营许可资质；</p>
                <p>（3）商家及其法定代表人均不存在重大法律诉讼及重大信用违约记录。</p>
                <p><span>2、商家申请药金融信息服务平台具体服务的，应按本公司要求准备融资相关资料，且商家应保证向本公司提供的所有资料和信息均为真实、完整、合法、有效信息。</span></p>
                <h4>四、特别提示</h4>
                <p><span>1、本公司仅为商家提供信息咨询服务，为商家建议或推荐合适的金融产品、金融机构或融资方案等，不负责对商家或金融机构资质、金融产品或融资方案等具体融资内容的调查与审核，不对金融产品购买协议的协议方的任何口头、书面陈述之真实性、合法性做任何明示或暗示的担保，或对此承担任何连带责任，不对金融机构及任何第三方的法定义务和/或契约责任承担任何连带责任。商家因上述资质或融资内容等原因导致与任何第三方纠纷的，由商家自行承担责任。</span></p>
                <p><span>2、本公司将负责为商家推荐合适金融机构，但不对融资授信成功与否承担责任和义务，最终批复结果以金融机构审核批复为准。</span></p>
                <h4>五、双方权利义务</h4>
                <p>1、本公司对所获得的商家企业信息有保密义务，信息及资料使用仅限与本公司与本服务有关的人员、关联公司及合作的金融机构等主体使用。如向无关的他方提供需征得商家口头或书面同意。</p>
                <p>2、商家应当按本协议的要求提供相关信息内容，并确保所提供信息内容的真实性和合法性，发生变更时应及时通知本公司。若商家提交虚假、过期文件或未如期通知并提交更新文件等情形的，由商家独立承担全部法律责任，且商家应按照本公司的要求补充提供相关资料。如商家造成本公司及其他任何第三方损失的，应足额赔偿。</p>
                <p>3、商家承诺并保证，本公司平台上现在以及本协议有效期间所不时公布的规则、声明、交易流程均对商家具有约束力，将自动适用于商家，商家应当予以遵守。</p>
                <p>4、商家有义务按照合同约定，在成功获得本公司推荐的金融机构授信后向本公司支付因使用本服务而产生的咨询服务费，金融机构授信成功与否以及最终授信额度以本公司系统记录为准。</p>
                <p>5、具体融资服务内容应以商家与金融机构另行签署的协议约定为准，商家不得以金融机构未实际提供融资服务而拒绝向本公司支付服务费，也不得因此向本公司索要已支付的服务费。</p>
                <p><span>6、商家授权并同意本公司收集、保存、使用商家的相关数据并将其提供给金融机构，数据内容包括但不限于公司基础资料、财务资料、商家在我的医药网平台的交易数据等，具体按照《商家授权协议》执行。</span></p>
                <p><span>7、本公司有权根据风险及自身业务控制情况对商家是否可以使用本协议约定的服务进行风险审查，因此可能导致对商家提供的药金融信息服务延迟或限制或终止的，不视为本公司的违约。</span></p>
                <p><span>8、商家理解并同意本公司对其风险审查，且本公司有权根据交易风险程度随时调整风险策略。</span></p>
                <p><span>9、在下列情况下，本公司可以中断对商家的服务：</span></p>
                <p><span>（1）不可抗力；</span></p>
                <p><span>（2）为维护、检修、升级系统的需要以及相关第三方为维护、检修、升级系统所使用的主机、电力设备、公共网络等相关配套设施需要；</span></p>
                <p><span>（3）商家存在违反法律法规及本协议内容的行为，经本公司通知后在规定期限内不予更正的；</span></p>
                <p><span>（4）司法机关或政府行政机关依照法定程序要求本公司中断对商家的服务的；</span></p>
                <p><span>（5）为公共利益的需要必须中断对商家的服务的；</span></p>
                <p><span>（6）本协议中约定的其他可中断服务的情况；</span></p>
                <p><span>（7）其他必须中断服务的情况。</span></p>
                <p><span>10、商家同意，本公司不对因下述任一情况而发生的服务中断或终止而承担任何赔偿责任，且有权对您的账户进行调查：</span></p>
                <p><span>（1）本公司基于合理怀疑，认为商家已经违反本服务条款的规定，将中断或终止向商家提供本公司部分或全部服务功能。</span></p>
                <p><span>（2）本公司在发现商家提供资料虚假、有异常交易或有疑义或有违法嫌疑时，不经通知有权先行中断或终止服务，并拒绝商家使用本公司部分或全部服务功能。</span></p>
                <h4>六、服务费用</h4>
                <p><span>商家知晓并同意，本公司保留向商家收取服务费的权利。一旦本公司确定收取或调整服务费收取方式及标准，将以在本公司网站发布公告及邮件等方式通知。商家同意按照双方协商确定的标准通过补充协议的形式向本公司支付服务费。</span></p>
                <h4>七、保密条款</h4>
                <p>1、对于本公司向商家提交的信息，未经本公司事先书面同意，商家不得向任何第三方(除商家的授权代表外)披露上述资料、双方在执行服务中的工作内容以及本协议和其它相关往来文件的内容，本款项下的保密义务自本公司向商家披露相关资料之日起，至本公司或其授权第三方主动披露上述资料及信息之日止。</p>
                <p>2、双方应当对在履行本协议过程中知悉的对方的商业秘密，包括技术信息、经营信息以及本协议和其他相关往来文件等内容，负有保密义务，未经对方事先书面同意，不得向任何第三方（除该方的授权代表外）披露。任何一方可仅为本协议目的向其确有知悉必要的雇员披露对方的商业秘密，但同时须指示其雇员遵守本条规定的保密及不披露义务。任何一方应仅为本协议目的而复制和使用对方的商业秘密。但因司法程序的原因公开、政府机构要求公开的除外。本款项下的保密义务自本协议生效之日起至本协议终止之日后一年止。</p>
                <p>3、本协议无论由于何原因终止或解除，均不影响甲乙双方继续承担本协议项下的保密义务。如任何一方违反上述保密义务，另一方有权终止解除本协议，并要求违约方承担赔偿责任。</p>
                <h4>八、不可抗力及除外责任</h4>
                <p>1、因不可抗力（包括自然灾害、战争、政府行为、罢工等不能预见、不能避免和不能克服的客观情况等）致使一方无法履行或无法全部履行本协议的，双方可根据实际情况协商决定部分履行、延期履行或终止本协议，部分或全部免除违约责任。</p>
                <p>2、因互联网灾难、黑客攻击以及互联网通讯提供商原因导致任意一方服务器不能正常运行，不视为违约行为，双方应尽商业上的合理努力争取尽快恢复正常服务。</p>
                <p>3、受不可抗力影响的一方应及时通知对方，并在不可抗力事件发生后五个工作日内将不能履行本协议的原因书面通知对方，并提供有关证明文件。</p>
                <p>4、因不可抗力、本公司的原因或其它非商家原因导致商家执行延迟的，商家不承担违约责任，商家仍应当按照本协议或补充协议约定向本公司支付全额的服务总费用。</p>
                <h4>九、违约和终止</h4>
                <p>1、一方违反其在本协议项下的任何义务和责任，另一方有权要求违约方限期改正，如违约方在十五日内未能改正的，守约方有权书面通知对方解除本协议，并有权要求违约方赔偿守约方所有经济损失。</p>
                <p><span>2、如果商家未能按本协议或补充协议约定时间按时足额向本公司指定银行账户支付费用，商家应当按照应付未付款项的万分之五每日的标准向本公司支付滞纳金；如果逾期十五日商家未能足额支付所有费用，本公司有权终止和解除本协议，并且本公司有权终止和商家的一切合作，商家应当向本公司支付本协议服务项目总费用的20%作为违约金，如给本公司造成超过前述违约金的其他损失、损害，商家仍旧应当向本公司赔偿和承担。</span></p>
                <p><span>3、如果商家提供的资质证照或信息资料不属实，本公司有权拒绝向商家提供本协议项下的任何服务并有权终止本协议。如果情节严重的，本公司有权要求商家赔偿和承担本公司因此遭受的任何损失、损害，并有权通过相关主管部门追究商家的法律责任。</span></p>
                <p>4、一方因其法人主体资格被撤销、注销或破产重组，或其在本协议项下的资质证照失效或被依法取缔的，另一方有权以书面形式通知终止解除本协议。</p>
                <p>5、因不可抗力因素造成本次合作无法继续开展，或合作目的无法达成的，任何一方均有权提前十五日以书面形式通知解除本协议，对此双方互不承担违约责任。</p>
                <h4>十、法律适用及争议解决</h4>
                <p>本协议的形成、效力、解释、签署、修改及终止均受中国法律管辖。因履行本协议或与本协议有关的一切争议，双方当事人应友好协商解决；如果协商未成，则该争议事项应提交至北京市朝阳区人民法院诉讼解决。</p>
                <h4>十一、通知及送达</h4>
                <p>1、关于本协议条款和其他协议、告示或其他有关使用本服务的通知，本公司将以电子形式或纸张形式通知商家，包括但不限于依据商家向本公司提供的电子邮件地址发送电子邮件的方式、依据商家提供的联系地址寄送挂号信的方式、于本网站或合作伙伴网站上公布、发送手机短信和电话通知等方式。</p>
                <p>2、本公司及其本公司之关联公司、本公司的合作金融机构向商家注册时预留的联系地址、电话、电子邮箱发出与本协议或本服务有关的资料、单据和文件以及其他信息资料时即视为有效送达。</p>
                <h4>十二、一般规定</h4>
                <p>1、本协议体现了双方就协议事宜所达成的所有协议内容，并取代之前就合作事项所达成的一切书面或口头协议。</p>
                <p>2、本协议旨在确定双方合作的主要意向，若本协议签署后双方经协商一致同意进行具体合作的，应签署具体的项目协议，对有关具体合作的方式、合作期限、合作费用承担等内容进行约定。</p>
                <p>3、商家同意，本公司有权随时对本协议内容进行单方面的变更，并以网站公告形式通知商家，该等变更将在公告载明的生效时间生效；如果商家不同意本公司对本协议相关条款所做的修改，商家应立即停止使用本公司提供的本项服务。如果商家继续使用本公司提供的服务，则视为本公司接受并认可本协议相关条款的修改。</p>
                <p>4、本协议的成立、生效、履行和解释，均适用中华人民共和国法律；法律无明文规定的，应适用本公司网站相关协议及附属规则和药金融信息服务平台实时公示的相关规则及服务政策。</p>
                <p>5、本协议任何条款若与金融机构所签署的协议相冲突，以后者的协议为准。</p>
            </div>
            <div slot="footer">
                <Button @click="coloseModal" type="primary">关闭</Button>
            </div>
        </Modal>

        <Modal v-model="isModalShoper" class-name="vertical-center-modal" width="900">
            <div class="protocolText">
                <h3 slot="header">商家授权协议</h3>
                <p>本协议是由 “北京融贯电子商务有限公司”（以下简称“融贯”）<span>与拥有 GMP或者GSP资质的药品、器械、大健康等商品生产、批发、销售的法律实体</span>（以下简称“您”或“商家”）共同签署，就您使用融贯供应链金融服务的相关信息授权所订立的契约等。<span>您通过网络页面点击确认，即表示您同意接受本协议的全部约定内容以及与本协议有关的已经发布或将来可能发布的各项规则、页面展示、操作流程、公告或通知（以下统称“规则”）。</span>在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以粗体标注的内容）。如果您不同意本协议的任意内容，或者无法准确理解该条款的含义，请不要进行任何操作。</p>
                <h4>一、商家信息的收集与使用</h4>
                <h4>（一）   信息收集的类别</h4>
                <p>1.   各平台应用相关的信息：商家在使用融贯各平台的PC端或APP或微信小程序等应用中产生的相关信息，例如企业基本信息、企业身份信息、企业财产信息、平台交易信息、银行卡信息、发票信息等。</p>
                <p>2.   与供应链金融服务相关的企业信息：商家在使用融贯提供的供应链金融相关服务时提供的或授权融贯收集的相关信息，例如企业基本信息、企业身份信息、企业财产信息、平台交易信息、<span>医保流水数据</span>、选择的金融产品信息、企业法定代表人及其配偶信息、企业实际控制人及其配偶信息等。</p>
                <h4>（二）信息收集的方法</h4>
                <p>融贯会通过如下五种渠道获取商家的企业信息：</p>
                <p>1、商家直接提供的信息：融贯可能收集并存储商家在使用融贯各平台服务和供应链金融服务时提供的任何信息，包括商家在平台页面中在线填写信息时、参与网络社区讨论时、解决争议或就供应链金融服务与我们联系时所提供的信息，以及商家在使用融贯各项服务过程中产生的交易和活动信息。</p>
                <p>2、主动收集的信息：在商家通过网页、APP、微信小程序等方式使用融贯各平台服务及供应链金融服务过程中，融贯会收集商家的计算机、手机及其他访问设备发送的信息。</p>
                <p>3、其他来源取得的信息：在取得商家同意的前提下，融贯还可能从融贯的关联公司及合作伙伴、信用机构及依法成立并合法留存商家的相关信息的第三方机构获取的相关息</p>
                <p>4、向行政机关、司法机关查询、打印、留存的信息；</p>
                <p>5、其他从合法途径获得的信息。</p>
                <h4>（三）商家信息的使用</h4>
                <p><span>1、进行实名制管理</span></p>
                <p>商家在使用融贯供应链金融服务时需要首先通过企业信息真实性的认证，若商家不提供相关信息则无法使用任何平台及供应链金融服务。</p>
                <p><span>2、进行资格、信用及偿付能力审核</span></p>
                <p>商家在使用融贯供应链金融服务时，融贯会使用您的企业基本信息、企业身份信息、企业财产信息及其他在具体业务开展过程中基于商家的同意而采集或从第三方获取的信息以评估商家的信用状况，配合合作的金融机构 <span>（指与为商家提供贷款、保理等金融服务的银行、保理公司、小贷公司等金融机构）</span>进行风险管理及控制。同时，检测、预防或修复欺诈或其他潜在的非法活动。同时，在商家享受融贯供应链金融服务的过程中，融贯会持续性的利用上述信息检测，防止或纠正违反相关法律法规或平台协议的行为。</p>
                <p><span>3、提供供应链金融相关服务</span></p>
                <p>在商家使用融贯供应链金融服务时，融贯会将商家的企业基本信息、企业身份信息、企业财产信息、融贯各平台交易信息、企业法定代表人及其配偶、企业实际控制人及其配偶信息及其他在业务具体开展过程中基于商家的同意而采集的信息，提供给与融贯合作的金融机构。同时，为了遵守相关法律法规及监管规定，也为了便于商家查询交易记录或历史状态，融贯会将商家使用融贯供应链金融服务时的身份信息、交易���息及行为信息进行存档，并严格按照法律法规的规定对这些信息进行妥善保管。</p>
                <p><span>4、进行营销活动</span></p>
                <p>融贯可能会利用商家提供的以及融贯自行采集的信息为商家推荐个性化的供应链金融产品或服务。若商家不想接收营销信息，可以关闭相关推送功能。</p>
                <p><span>5、发送通知</span></p>
                <p>融贯可能会不时使用商家的企业信息来发送重要通知，例如有关供应链金融产品的更新和本协议和政策的变更。</p>
                <h4>二、商家充分知晓，以下情形无需征得商家的授权同意：</h4>
                <p>1、与国家安全、国防安全有关的；</p>
                <p>2、与公共安全、公共卫生、重大公共利益有关的；</p>
                <p>3、与犯罪侦查、起诉、审判和判决执行等有关的；</p>
                <p>4、出于维护企业信息主体或其他企业的生命、财产等重大合法权益但又很难得到本人同意的；</p>
                <p>5、所收集的企业信息是企业信息主体自行向社会公众公开的；</p>
                <p>6、从合法公开披露的信息中收集的您的企业信息的，如合法的新闻报道、政府信息公开等渠道；</p>
                <p>7、根据商家的要求签订合同所���需的；</p>
                <p>8、为合法的新闻报道所必需的；</p>
                <p>9、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的企业信息进行去标识化处理的；</p>
                <p>10、法律法规规定的其他情形。 </p>
                <h4>三、商家信息的共享、转让与公开披露</h4>
                <h4>（一）共享</h4>
                <p>1、融贯不会与融贯（及相关关联公司或者相关服务提供的主体）以外的任何公司、组织和企业共享商家的信息，但以下情况除外：</p>
                <p>（1）事先获得商家明确的同意或授权；</p>
                <p>根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供；</p>
                <p>（2）为建立信用体系，向第三方征信机构提交商家在使用融贯服务过程中产生的相关信息，包括企业基本信息，企业敏感信息、反映企业信用的其他信息。<span>商家同意并授权融贯向征信机构发送商家的不良信用信息，且不再另行通知商家。若发生不良，借款人同意金融机构有权停止向借款人提供任何服务，因此给借款人造成损失的，前述主体均不承担赔偿责任。</span></p>
                <p>（3）在法律法规允许的范围内，为维护融贯及融贯关联公司或合作伙伴、商家或社会公众利益、财产或安全免遭损害而有必要提供；</p>
                <p>（4） 只有共享商家的信息，才能实现融贯的产品或服务的核心功能或提供商家需要的服务；</p>
                <p>（5）应商家需求为商家处理相关纠纷或争议；</p>
                <p>（6）符合与商家签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；</p>
                <p>（7）基于学术研究而使用；</p>
                <p>（8）基于符合法律法规的社会公共利益而使用。</p>
                <p>2、为了顺利地从事商业经营，以向商家提供产品和服务的全部功能，我们可能不时向其他的融贯关联公司共享您的信息。</p>
                <p>3、融贯可能会向合作的金融机构等第三方共享商家的交易信息、 账户信息及设备信息等企业信息，以保障为商家提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享商家的信息，并且只会共享提供服务所必要的信息。<span>我们合作的金融机构等第三方无权将共享的信息用于任何其他用途。</span></p>
                <p>4、对融贯与之共享信息的任何机构，我们会与其签署严格的保密协定，要求他们按照采取保密和安全措施来处理商家信息。</p>
                <h4>（二）转让</h4>
                <p>融贯不会将商户的信息转让给任何机构，但以下情况除外：</p>
                <p>1、事先获得商家明确的同意或授权；
                <p>2、根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
                <p>3、符合与商家签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；</p>
                <p>4、在涉及合并、收购、资产转让或类似的交易时，如涉及到商家信息转让，会要求新的持有商家信息的公机构继续受本协议的约束，否则,融贯将要求该组织重新向商家征求授权同意。</p>
                <h4>（三）公开披露</h4>
                <p>融贯仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露商家的信息：</p>
                <p>1、根据商家的需求，在商家明确同意的披露方式下披露商家所指定的信息；</p>
                <p>2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供商家信息的情况下，融贯可能会依据所要求的信息类型和披露方���公开披露商家的信息。</p>

                <h4>四、 其他条款</h4>
                <p><span>1、双方同意本协议中的授权不可撤回或撤销。</span></p>
                <p><span>2、商家同意，融贯有权随时对本协议内容进行单方面的变更，并以网站公告形式通知商家，该等变更将在公告载明的生效时间生效；如果商家不同意乙方对本协议相关条款所做的修改，商家应立即停止使用融贯提供的本项服务。如果商家继续使用融贯提供的服务，则视为商家接受并认可本协议相关条款的修改。</span></p>
                <p><span>3、因履行本协议发生纠纷的，任何一方应向北京市朝阳区人民法院提起诉讼。</span></p>
            </div>
            <div slot="footer">
                <Button @click="coloseModalShoper" type="primary">关闭</Button>
            </div>
        </Modal>
    </div>
</template>

<script>
    export default {
        name: "agreements",
        data () {
            return{
                isModalShoper: false,
                isModalProtocol: false,
            }
        },
        computed: {
        },
        methods: {
            coloseModal () {
                this.isModalProtocol = false
            },
            coloseModalShoper () {
                this.isModalShoper = false
            }
        },
        created () {
        },
        mounted () {
        },
        watch: {
        }

    }
</script>

<style lang="less">
    .protocolText{
        overflow: auto;
        h3 {
            margin-top: 10px;
            margin-bottom: 10px;
            font-size: 18px;
            text-align: center;
        }
        h4 {
            font-size: 16px;
        }
        p{
            line-height: 20px;
            font-size: 14px;
            span {
                font-weight: bold;
            }
        }
    }
    .Agreement {
        width: 100%;
        text-align: center;
        margin-top: 20px;
        .ivu-form-item-content {
            margin-left: 0!important;
        }
        .ivu-form-item-error-tip {
            width: 100%;
        }
        span {
            color: #0854CE;
            cursor: pointer;
        }
    }
</style>



// WEBPACK FOOTER //
// src/views/user/components/agreements.vue